system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0.0145 0.0145 -0.01)           
    (-0.0145 0.0145 -0.01)          
    (0.0145 -0.0145 -0.01)           
    (-0.0145 -0.0145 -0.01)          
    (0.0145 0.0145 0.874)           
    (-0.0145 0.0145 0.874)          
    (0.0145 -0.0145 0.874)           
    (-0.0145 -0.0145 0.874)
);

blocks
(
  hex (0 1 3 2 4 5 7 6) (20 20 60) simpleGrading (1 1 1)
);

