0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

//nu $nuu;
//d $LL;
//Re $Ree;
//v #eval{$Re * ($nu/$d)};
v 0.5;

boundaryField
{
    wall_inlet
    {
        type            noSlip;
    }
    wall_outlet
    {
        type            noSlip;
    }
    plate_inlet
    {
        type            noSlip;
    }
    plate_outlet
    {
        type            noSlip;
    }
    porous
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 $v);
    }
    outlet
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
