system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Definición de las superficies STL y los parámetros de extracción
    inlet.stl
    {
        extractionMethod    extractFromSurface;
        includedAngle       150; // Ángulo amplio para capturar las curvas
        writeObj            no; // Escribir el archivo OBJ con las características extraídas
    }

    outlet.stl
    {
        extractionMethod    extractFromSurface;
        includedAngle       150; // ángulo amplio para capturar las curvas
        writeObj            no; // escribir el archivo obj con las características extraídas
    }
    wall_outlet.stl
    {
        extractionMethod    extractFromSurface;
        includedAngle       150; // ángulo amplio para capturar las curvas
        writeObj            no; // escribir el archivo obj con las características extraídas
    }
    wall_inlet.stl
    {
        extractionMethod    extractFromSurface;
        includedAngle       150; // ángulo amplio para capturar las curvas
        writeObj            no; // escribir el archivo obj con las características extraídas
    }
    plate_inlet.stl
    {
        extractionMethod    extractFromSurface;
        includedAngle       150; // ángulo amplio para capturar las curvas
        writeObj            no; // escribir el archivo obj con las características extraídas
    }
    plate_outlet.stl
    {
        extractionMethod    extractFromSurface;
        includedAngle       150; // ángulo amplio para capturar las curvas
        writeObj            no; // escribir el archivo obj con las características extraídas
    }
    porous.stl
    {
        extractionMethod    extractFromSurface;
        includedAngle       150; // ángulo amplio para capturar las curvas
        writeObj            no; // escribir el archivo obj con las características extraídas
    }
